.sample-xml/account-info-request-response.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <QUERYIACUSTACC_IOFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSIAService">
         <FCUBS_HEADER>
            <SOURCE>SMFBPORTAL</SOURCE>
            <UBSCOMP>FCUBS</UBSCOMP>
            <MSGID>6125041006534255</MSGID>
            <CORRELID>null</CORRELID>
            <USERID>SYSTEM</USERID>
            <ENTITY>null</ENTITY>
            <BRANCH>002</BRANCH>
            <MODULEID>IA</MODULEID>
            <SERVICE>FCUBSIAService</SERVICE>
            <OPERATION>QueryIACustAcc</OPERATION>
            <DESTINATION>SMFBPORTAL</DESTINATION>
            <FUNCTIONID>IADCUSAC</FUNCTIONID>
            <ACTION>EXECUTEQUERY</ACTION>
            <MSGSTAT>SUCCESS</MSGSTAT>
         </FCUBS_HEADER>
         <FCUBS_BODY>
            <Cust-Account-Full>
               <BRN>002</BRN>
               <ACC>0010172338</ACC>
               <CUSTNO>007129</CUSTNO>
               <ACCLS>STAF</ACCLS>
               <CCY>KES</CCY>
               <CUSTNAME>MOHAMED NOOR ABDI AHMED</CUSTNAME>
               <ADESC>MOHAMED NOOR ABDI AHMED</ADESC>
               <ACSTATNODR>N</ACSTATNODR>
               <ACSTATNOCR>N</ACSTATNOCR>
               <ACSTATSTPAY>N</ACSTATSTPAY>
               <ACCTYPE>S</ACCTYPE>
               <ACCOPENDT>2022-12-19</ACCOPENDT>
               <ALTACC>0010172338</ALTACC>
               <FROZEN>N</FROZEN>
               <ADDRESS_1>P.O BOX 7447 - 00610</ADDRESS_1>
               <ADDRESS_2>HIGHRIDGE MALL A03 3rd PARKLANDS</ADDRESS_2>
               <ADDRESS_4>NAIROBI</ADDRESS_4>
               <POSTALLOWED>Y</POSTALLOWED>
               <CLRACNO>0010172338</CLRACNO>
               <TRKREC>Y</TRKREC>
               <REFREQ>N</REFREQ>
               <ACCSTAT>NORM</ACCSTAT>
               <STATSINCE>2022-12-19</STATSINCE>
               <INHERITREP>N</INHERITREP>
               <AUTOSTATCHANGE>Y</AUTOSTATCHANGE>
               <DORMPRM>M</DORMPRM>
               <LOC>KE</LOC>
               <MEDIA>MAIL</MEDIA>
               <CHQBOOK>N</CHQBOOK>
               <PASSBOOK>N</PASSBOOK>
               <CASACC>N</CASACC>
               <TYOFCHQ>C</TYOFCHQ>
               <MT210REQD>N</MT210REQD>
               <POSPAYAC>N</POSPAYAC>
               <AUTOREORDERCHKREQ>N</AUTOREORDERCHKREQ>
               <LODGEBKFAC>N</LODGEBKFAC>
               <ALLWBKPERENTRY>Y</ALLWBKPERENTRY>
               <AUTOPROVREQ>N</AUTOPROVREQ>
               <PROVCCYTYPE>L</PROVCCYTYPE>
               <DEFRECON>N</DEFRECON>
               <CONSREQD>N</CONSREQD>
               <FUNDING>N</FUNDING>
               <MOD9RQD>N</MOD9RQD>
               <ATM>Y</ATM>
               <ACSTMTTYPEP>N</ACSTMTTYPEP>
               <DISPIBANINADV>N</DISPIBANINADV>
               <ACSTMTTYPS>N</ACSTMTTYPS>
               <ACSTMTTYPE3>N</ACSTMTTYPE3>
               <FLGEXCLRVRTRANS>N</FLGEXCLRVRTRANS>
               <SWPTYPE>1</SWPTYPE>
               <REGDAPP>N</REGDAPP>
               <REGDPER>N</REGDPER>
               <PRDLST>D</PRDLST>
               <TXNLST>D</TXNLST>
               <SPCONDLST>N</SPCONDLST>
               <SPCONDTXN>N</SPCONDTXN>
               <OPMODE>S</OPMODE>
               <ODREQ>N</ODREQ>
               <DAYLIGHTLIMIT>0</DAYLIGHTLIMIT>
               <WAIVE_ACC_OPEN_CHARGE>N</WAIVE_ACC_OPEN_CHARGE>
               <COUNTRY_CODE>KE</COUNTRY_CODE>
               <ESCROWTRN>N</ESCROWTRN>
               <SALARY_ACCOUNT>N</SALARY_ACCOUNT>
               <REPL_CUST_SIG>N</REPL_CUST_SIG>
               <ACCOUNTAUTOCLOSED>N</ACCOUNTAUTOCLOSED>
               <CRS_STST_REQD>N</CRS_STST_REQD>
               <MT110_RECON_REQD>N</MT110_RECON_REQD>
               <PROJACC>N</PROJACC>
               <PRIVATE_CUSTOMER>N</PRIVATE_CUSTOMER>
               <LIMIT_AUTO_CREATE_POOL>N</LIMIT_AUTO_CREATE_POOL>
               <DFLT_WAIVER>N</DFLT_WAIVER>
               <AUTO_DEBIT_CARD_REQUEST>N</AUTO_DEBIT_CARD_REQUEST>
               <AUTO_CHEQUE_BOOK_REQ>N</AUTO_CHEQUE_BOOK_REQ>
               <INTERMEDIARY_REQUIRED>N</INTERMEDIARY_REQUIRED>
               <NSFBLKSTAT>N</NSFBLKSTAT>
               <ENABLE_SWEEP_IN>N</ENABLE_SWEEP_IN>
               <ENABLE_REV_SWEEP_IN>N</ENABLE_REV_SWEEP_IN>
               <SPDANLSYS>N</SPDANLSYS>
               <CNTBTOPDM>N</CNTBTOPDM>
               <EXLFRMDISBN>Y</EXLFRMDISBN>
               <ACSTCLS>N</ACSTCLS>
               <AUTO_DEPOSIT>N</AUTO_DEPOSIT>
               <ZAKATEXEMPTION>N</ZAKATEXEMPTION>
               <IBANREQURED>N</IBANREQURED>
               <DIRECT_BANKING>Y</DIRECT_BANKING>
               <DROVD>N</DROVD>
               <CROVD>N</CROVD>
               <SPL_AC_GEN>N</SPL_AC_GEN>
               <DORMNT>N</DORMNT>
               <AC_STAT_CB_DORMANT>N</AC_STAT_CB_DORMANT>
               <BANCONTROL_FLAG>N</BANCONTROL_FLAG>
               <ALLOW_TD_COLL_LINK>N</ALLOW_TD_COLL_LINK>
               <MAKER>JMUNENE1</MAKER>
               <MAKERSTAMP>2023-04-19 10:04:43</MAKERSTAMP>
               <CHECKER>HSAID1</CHECKER>
               <CHECKERSTAMP>2023-04-19 10:06:28</CHECKERSTAMP>
               <MODNO>2</MODNO>
               <TXNSTAT>O</TXNSTAT>
               <AUTHSTAT>A</AUTHSTAT>
               <Provision-Main>
                  <PRVACCUI>0010172338</PRVACCUI>
               </Provision-Main>
               <Accmaintinstr>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
                  <DTOFLSTMAINT>2023-04-19</DTOFLSTMAINT>
               </Accmaintinstr>
               <Multi-Account-Generation/>
               <Interim-Details>
                  <GENINTRMSTMT>N</GENINTRMSTMT>
                  <GENINTRMSTMTMVMT>N</GENINTRMSTMTMVMT>
                  <GENBALRPT>N</GENBALRPT>
                  <BALRPTSINCE>950</BALRPTSINCE>
               </Interim-Details>
               <Acstatuslines>
                  <ACSTATUS>NORM</ACSTATUS>
                  <DRHOLINE>HOLINE_LEAF</DRHOLINE>
                  <CRHOLINE>HOLINE_LEAF</CRHOLINE>
                  <CRCBLINE>CBKLINE_LEAF</CRCBLINE>
                  <DRCBLINE>CBKLINE_LEAF</DRCBLINE>
                  <DRGL>2020230</DRGL>
                  <CRGL>2020230</CRGL>
                  <DESC>NORMAL STATUS</DESC>
               </Acstatuslines>
               <Intdetails>
                  <CALCACC>0010172338</CALCACC>
                  <PBOOKACC>0010172338</PBOOKACC>
                  <HASPS>Y</HASPS>
                  <PROFSTRTDT>2022-12-19</PROFSTRTDT>
                  <PBOOKACCBRN>002</PBOOKACCBRN>
                  <HASCRADV>N</HASCRADV>
                  <CHGBOOKACCBRN>002</CHGBOOKACCBRN>
                  <CHGBOOKACC>0010172338</CHGBOOKACC>
                  <CHGSTARTDT>2022-12-19</CHGSTARTDT>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
                  <CONSOLCHGBRN>002</CONSOLCHGBRN>
                  <Intprodmap>
                     <WAIVEINT>N</WAIVEINT>
                     <GENUDECHNGADV>N</GENUDECHNGADV>
                     <PRODMAPSTAT>O</PRODMAPSTAT>
                     <INTPROD>IPCA</INTPROD>
                     <Inteffdtmap>
                        <UDEEFFDT>2022-12-19</UDEEFFDT>
                        <EFFDTMAPSTAT>O</EFFDTMAPSTAT>
                        <Intsde>
                           <UDEID>MUDARABAH_RATE</UDEID>
                           <UDEVALUE>0</UDEVALUE>
                        </Intsde>
                        <Intsde>
                           <UDEID>TAX_RATE</UDEID>
                           <UDEVALUE>15</UDEVALUE>
                        </Intsde>
                     </Inteffdtmap>
                  </Intprodmap>
               </Intdetails>
               <Tddetails>
                  <TDCCY>KES</TDCCY>
                  <AUTOROLL>N</AUTOROLL>
                  <CLONMAT>N</CLONMAT>
                  <MOVINTUNCLM>N</MOVINTUNCLM>
                  <ROLLTYPE>P</ROLLTYPE>
                  <MOVPRIUNCLM>N</MOVPRIUNCLM>
                  <INTSTDT>2022-12-19</INTSTDT>
               </Tddetails>
               <Amount-Dates>
                  <LCY>KES</LCY>
                  <ACY>KES</ACY>
                  <PROFDUE>0</PROFDUE>
                  <PROVAMT>0</PROVAMT>
                  <CHG_DUE>0</CHG_DUE>
                  <WITHDRAWABLE_UNCOLLED_FUND>0</WITHDRAWABLE_UNCOLLED_FUND>
                  <ACY_OPENING_BAL>253.95</ACY_OPENING_BAL>
                  <LCY_OPENING_BAL>253.95</LCY_OPENING_BAL>
                  <ACY_TODAY_TOVER_DR>0</ACY_TODAY_TOVER_DR>
                  <LCY_TODAY_TOVER_DR>0</LCY_TODAY_TOVER_DR>
                  <ACY_TODAY_TOVER_CR>0</ACY_TODAY_TOVER_CR>
                  <LCY_TODAY_TOVER_CR>0</LCY_TODAY_TOVER_CR>
                  <ACY_TANK_CR>0</ACY_TANK_CR>
                  <ACY_TANK_DR>0</ACY_TANK_DR>
                  <LCY_TANK_CR>0</LCY_TANK_CR>
                  <LCY_TANK_DR>0</LCY_TANK_DR>
                  <ACY_TANK_UNCOLLECTED>0</ACY_TANK_UNCOLLECTED>
                  <ACY_CURR_BALANCE>253.95</ACY_CURR_BALANCE>
                  <LCY_CURR_BALANCE>253.95</LCY_CURR_BALANCE>
                  <ACY_BLOCKED_AMOUNT>0</ACY_BLOCKED_AMOUNT>
                  <ACY_AVL_BAL>253.95</ACY_AVL_BAL>
                  <ACY_UNAUTH_DR>0</ACY_UNAUTH_DR>
                  <ACY_UNAUTH_TANK_DR>0</ACY_UNAUTH_TANK_DR>
                  <ACY_UNAUTH_CR>0</ACY_UNAUTH_CR>
                  <ACY_UNAUTH_TANK_CR>0</ACY_UNAUTH_TANK_CR>
                  <ACY_UNAUTH_UNCOLLECTED>0</ACY_UNAUTH_UNCOLLECTED>
                  <ACY_UNAUTH_TANK_UNCOLLECTED>0</ACY_UNAUTH_TANK_UNCOLLECTED>
                  <ACY_ACCRUED_DR_IC>0</ACY_ACCRUED_DR_IC>
                  <ACY_ACCRUED_CR_IC>0</ACY_ACCRUED_CR_IC>
                  <DATE_LAST_CR_ACTIVITY>2025-02-01</DATE_LAST_CR_ACTIVITY>
                  <DATE_LAST_DR_ACTIVITY>2025-02-06</DATE_LAST_DR_ACTIVITY>
                  <DATE_LAST_DR>2025-02-06</DATE_LAST_DR>
                  <DATE_LAST_CR>2025-02-01</DATE_LAST_CR>
                  <ACY_UNCOLLECTED>0</ACY_UNCOLLECTED>
                  <RECEIVABLE_AMOUNT>0</RECEIVABLE_AMOUNT>
                  <DC_ACY_OPEN_BAL>Cr</DC_ACY_OPEN_BAL>
                  <DC_LCY_OPEN_BAL>Cr</DC_LCY_OPEN_BAL>
                  <DC_ACY_TANK_UNCOLLECTED>Cr</DC_ACY_TANK_UNCOLLECTED>
                  <DC_ACY_CURR_BAL>Cr</DC_ACY_CURR_BAL>
                  <DC_WITHDRAWABLE_UNCOLLED_FUND>Cr</DC_WITHDRAWABLE_UNCOLLED_FUND>
                  <DC_ACY_UNCOLLECTED>Cr</DC_ACY_UNCOLLECTED>
                  <DC_ACY_AVL_BAL>Cr</DC_ACY_AVL_BAL>
                  <DIS_UNUTILIZED_AMT>0</DIS_UNUTILIZED_AMT>
                  <DIS_TOT_AVL_AMOUNT>253.95</DIS_TOT_AVL_AMOUNT>
                  <DC_TOT_AVL_AMOUNT>Cr</DC_TOT_AVL_AMOUNT>
                  <DC_LCY_CURR_BAL>Cr</DC_LCY_CURR_BAL>
                  <ACY_UNAUTH>KES</ACY_UNAUTH>
                  <DC_ACY_UNAUTH_TANK_UNCOL>Cr</DC_ACY_UNAUTH_TANK_UNCOL>
                  <UTILIZED_AMT>0</UTILIZED_AMT>
                  <LIMIT_AMOUNT>0</LIMIT_AMOUNT>
                  <SWEEP_ELIG_BAL>0</SWEEP_ELIG_BAL>
                  <AMTDUE>0</AMTDUE>
                  <Turnovers>
                     <ACY_MTD_TOVER_DR>313</ACY_MTD_TOVER_DR>
                     <LCY_MTD_TOVER_DR>313</LCY_MTD_TOVER_DR>
                     <ACY_MTD_TOVER_CR>566.95</ACY_MTD_TOVER_CR>
                     <LCY_MTD_TOVER_CR>566.95</LCY_MTD_TOVER_CR>
                     <ACY_TOV>KES</ACY_TOV>
                     <LCY_TOV>KES</LCY_TOV>
                  </Turnovers>
               </Amount-Dates>
               <Noticepref>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
                  <ADVPRFREQD>N</ADVPRFREQD>
               </Noticepref>
               <Acc-Nominees>
                  <NOMMINOR>N</NOMMINOR>
                  <NAM>ABDIKARIM HASSAN ALI NOOR</NAM>
                  <RELSHIP>COUSIN</RELSHIP>
               </Acc-Nominees>
               <Tod-Renew>
                  <RNW_FLG>N</RNW_FLG>
               </Tod-Renew>
               <Doctype-Remarks>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_AC_NO>0010172338</CUST_AC_NO>
                  <SEND_NOTIFICATION>N</SEND_NOTIFICATION>
               </Doctype-Remarks>
               <Cust-Acc-Check/>
               <Summary>
                  <BRN>002</BRN>
                  <CUSTNO>007129</CUSTNO>
                  <CCY>KES</CCY>
                  <ACSTATSTPAY>N</ACSTATSTPAY>
                  <ADESC>MOHAMED NOOR ABDI AHMED</ADESC>
                  <DORM>N</DORM>
                  <ACCOPENDT>2022-12-19</ACCOPENDT>
                  <MT110RECONREQD>N</MT110RECONREQD>
                  <FROZEN>N</FROZEN>
                  <PROJECTACCNT>N</PROJECTACCNT>
                  <ACCLSTYP>S</ACCLSTYP>
                  <ACSTATNOCR>N</ACSTATNOCR>
                  <ACC>0010172338</ACC>
                  <ALTACC>0010172338</ALTACC>
                  <ACSTATNODR>N</ACSTATNODR>
                  <ATM>Y</ATM>
                  <ACCLS>STAF</ACCLS>
                  <CHQBOOK>N</CHQBOOK>
                  <PASSBOOK>N</PASSBOOK>
               </Summary>
               <Custacc>
                  <BRN>002</BRN>
                  <CUSTACNO>0010172338</CUSTACNO>
                  <LinkedEntities>
                     <CUSTOMER>007129</CUSTOMER>
                     <RELATIONSHIP>PRIMARY</RELATIONSHIP>
                     <INHERIT>N</INHERIT>
                     <CUSTNAME>MOHAMED NOOR ABDI AHMED</CUSTNAME>
                     <APP_FOR_SIGNATURE>N</APP_FOR_SIGNATURE>
                  </LinkedEntities>
               </Custacc>
               <Custacc-Icccspcn>
                  <BRNCD>002</BRNCD>
                  <ACCNO>0010172338</ACCNO>
               </Custacc-Icccspcn>
               <Custacc-Icchspcn>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
               </Custacc-Icchspcn>
               <Custacc-Iccinstr>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
                  <Autodepdetails>
                     <ACCCCY>KES</ACCCCY>
                     <CUSTOMER>007129</CUSTOMER>
                     <SEQNO>1</SEQNO>
                  </Autodepdetails>
               </Custacc-Iccinstr>
               <CustAcc>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
                  <Misdetails>
                     <POOLCD>DFLTPOOL</POOLCD>
                     <REFRTTYPE>X</REFRTTYPE>
                     <CALCMETH>1</CALCMETH>
                     <RTFLAG>P</RTFLAG>
                  </Misdetails>
               </CustAcc>
               <Custacc-Sicdiary>
                  <BRNCD>002</BRNCD>
                  <ACCNO>0010172338</ACCNO>
               </Custacc-Sicdiary>
               <Custacc-Stccusbl>
                  <BRN>002</BRN>
                  <ACCNO>0010172338</ACCNO>
               </Custacc-Stccusbl>
               <Accclose>
                  <BRN>002</BRN>
                  <ACC>0010172338</ACC>
               </Accclose>
               <Acc-Svcacsig>
                  <ACBRN1>002</ACBRN1>
                  <ACTNO>0010172338</ACTNO>
                  <ACDESC>MOHAMED NOOR ABDI AHMED</ACDESC>
                  <ACCCY>KES</ACCCY>
               </Acc-Svcacsig>
               <Sttms-Debit>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_NO>007129</CUST_NO>
                  <ACTNO>0010172338</ACTNO>
                  <Sttms-Detail>
                     <BRANCH_CODE>002</BRANCH_CODE>
                     <REQUEST_REFERENCE_NO>001ZCRS231090003</REQUEST_REFERENCE_NO>
                     <CARDNO>00100712901</CARDNO>
                     <CUST_NO>007129</CUST_NO>
                     <CARD_PRODUCT>KCPA</CARD_PRODUCT>
                     <PRIMARY_CARD>Y</PRIMARY_CARD>
                     <NAME_ON_CARD>MOHAMED NOOR ABDI AHMED</NAME_ON_CARD>
                     <OWNER_ID_NO>39287462</OWNER_ID_NO>
                     <CARD_ISSUED_DT>2023-03-31</CARD_ISSUED_DT>
                     <CARD_EXPIRY_DT>2025-10-31</CARD_EXPIRY_DT>
                     <CARD_STATUS>I</CARD_STATUS>
                     <RECORD_STAT>O</RECORD_STAT>
                     <AUTH_STAT>A</AUTH_STAT>
                     <CARD_BIN>56445300</CARD_BIN>
                     <CUST_AC_NO>0010172338</CUST_AC_NO>
                  </Sttms-Detail>
               </Sttms-Debit>
               <Custacc-Iccintpo>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_AC_NO>0010172338</CUST_AC_NO>
                  <CCY>KES</CCY>
                  <Bcpayout-Int/>
                  <Pcpayout-Int/>
               </Custacc-Iccintpo>
               <Customer-Acc>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_AC_NO>0010172338</CUST_AC_NO>
               </Customer-Acc>
               <Sttms-Cust-Acc-Swp>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_AC_NO>0010172338</CUST_AC_NO>
               </Sttms-Cust-Acc-Swp>
               <Acc-Chnl>
                  <BRANCH_CODE>002</BRANCH_CODE>
                  <CUST_AC_NO>0010172338</CUST_AC_NO>
               </Acc-Chnl>
               <UDFDETAILS>
                  <FLDNAM>EMAIL INDEMNITY</FLDNAM>
               </UDFDETAILS>
               <UDFDETAILS>
                  <FLDNAM>EMAIL ADRRESS</FLDNAM>
               </UDFDETAILS>
            </Cust-Account-Full>
            <FCUBS_WARNING_RESP>
               <WARNING>
                  <WCODE>ST-SAVE-023</WCODE>
                  <WDESC>Record Successfully Retrieved</WDESC>
               </WARNING>
            </FCUBS_WARNING_RESP>
         </FCUBS_BODY>
      </QUERYIACUSTACC_IOFS_RES>
   </S:Body>
</S:Envelope>